/* Error string for OTR message string */
"A private conversation could not be set up." = "加密對話無法建立。";

/* Title for the about page */
"About" = "關於";

/* Label for button to show version numbers and licenses */
"About This Version" = "關於這個版本";

/* SSL error message */
"Access denied" = "伺服器拒絕連線";

/* The string describing a buddy's account */
"Account" = "帳號";

/* Title for the accounts tab */
"Accounts" = "帳號";

/* Button title to add someone as a buddy */
"Add" = "添加";

/* The title for the view to add a buddy */
"Add Buddy" = "添加好友";

/* Label for button to create account by logging into an existing account */
"Add Existing Account" = "Add Existing Account";

/* String to describe advanced set of settings */
"Advanced" = "進階";

/* No comment provided by engineer. */
"Advanced Encryption Settings" = "Advanced Encryption Settings";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "加密訊息時發生錯誤，訊息沒有送出";

/* SSL error message */
"Attempt to restore an unknown session" = "嘗試恢復一個未知的連線";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "自動刪除";

/* Label in buddy list for users that are available */
"Available" = "上線";

/* Label in buddy list for users that are away */
"Away" = "離開";

/* SSL error message */
"Bad certificate format" = "錯誤的憑證格式";

/* SSL error message */
"Bad MAC" = "錯誤的 MAC 地址";

/* SSL error message */
"Bad protocol version" = "錯誤的通訊協定版本";

/* SSL error message */
"Bad SSLCipherSuite" = "錯誤的 SSLCipherSuite";

/* SSL error message */
"Bad unsupported cert format" = "不支援的憑證格式";

/* string to describe basic set of settings */
"Basic" = "基本";

/* username section */
"Basic Setup" = "Basic Setup";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "因為資料庫的內容已經用您的密碼加密，忘記密碼已使您失去對話紀錄，並且您必須刪除後重新安裝 ChatSecure，才能繼續使用它。建議您使用密碼管理員程式，例如 1Password 或 MiniKeePass，它們可以協助您產生和儲存強密碼。";

/* No comment provided by engineer. */
"Best Available" = "Best Available";

/* The String for a button to block a buddy */
"Block" = "屏蔽";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "屏蔽並刪除";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "好友信息";

/* Cancel an alert window */
"Cancel" = "取消";

/* Error string for OTR message string */
"Cannot read the received message." = "無法讀取已收到的訊息";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "無法辨識已收到 OTR 訊息的類型";

/* SSL error message */
"Cert chain not verified by root" = "憑證鍊未受根憑證確認";

/* SSL error message */
"Certificate expired" = "憑證過期";

/* SSL error message */
"Certificate revoked" = "憑證已撤銷";

/* SSL error message */
"Chain had a cert not yet valid" = "憑證鍊中有一個憑證無效";

/* SSL error message */
"Chain had an expired cert" = "憑證鍊中有一個憑證過期";

/* Title for chat view */
"Chat" = "聊天";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "加密的聊天應用程式";

/* Title for chats view */
"Chats" = "聊天";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure 訊息推送服務";

/* let users know source is on Github */
"Check out the source here on Github" = "到 GitHub 查看原始碼";

/* server selection footer */
"Choose from our list of trusted servers, or use your own." = "Choose from our list of trusted servers, or use your own.";

/* title for server selection screen */
"Choose Server" = "Choose Server";

/* SSL error message */
"Cipher Suite negotiation failure" = "Cipher Suite 發起連線失敗";

/* Label for text field where you compose a new message */
"Compose" = "撰寫新訊息";

/* SSL error message */
"Configuration error" = "設定錯誤";

/* String for button to connect connect */
"Connect" = "Connect";

/* Whether or not account is logged in */
"Connected" = "已連線";

/* String to state if an account is progress of creating a connection */
"Connecting" = "連線中";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "透過 Tor 連線";

/* SSL error message */
"Connection closed gracefully" = "連線正常結束";

/* SSL error message */
"Connection closed via error" = "連線因錯誤而結束";

/* Copy string to clipboard as in copy and paste */
"Copy" = "複製";

/* No comment provided by engineer. */
"Could not decrypt database. If the app is not working properly, you may need to delete and reinstall." = "Could not decrypt database. If the app is not working properly, you may need to delete and reinstall.";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "無法從憑證中取得公鑰";

/* No comment provided by engineer. */
"Crash Detected" = "Crash Detected";

/* Title for button to create account */
"Create" = "創建";

/* Label for button to create a new account via in band registration */
"Create New Account" = "開新帳號";

/* Start of sentence that will be followed by names */
"Created by" = "建立者";

/* Title for progress of creating a new account */
"Creating Account" = "開新帳號";

/* Place holder label for custom domains */
"Custom" = "Custom";

/* if you want to change your username */
"Customize Username" = "Customize Username";

/* No comment provided by engineer. */
"Database Error" = "Database Error";

/* SSL error message */
"Decoding error" = "解碼錯誤";

/* SSL error message */
"Decompression failure" = "解壓縮錯誤";

/* SSL error message */
"Decryption error" = "解密錯誤";

/* SSL error message */
"Decryption failed" = "解密失敗";

/* SSL error message */
"Decryption failure" = "解密失敗";

/* default string to revert to normal language behaviour */
"Default" = "預設";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "刪除帳號？";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "離線後刪除聊天記錄";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "已送達";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "請勿打擾";

/* No comment provided by engineer. */
"Don't change these unless you really know what you're doing. By default we will always select the best available encryption method." = "Don't change these unless you really know what you're doing. By default we will always select the best available encryption method.";

/* Title for donation link */
"Donate" = "捐款";

/* Title for button to press when user is finished */
"Done" = "完成";

/* The string describing account name or email address for a buddy */
"Email" = "電郵";

/* enable permission */
"Enable" = "Enable";

/* button for enabling push messages */
"Enable Push" = "Enable Push";

/* button for enabling push messages in iOS system settings */
"Enable Push in Settings" = "Enable Push in Settings";

/* No comment provided by engineer. */
"Enable Tor" = "Enable Tor";

/* Generic title for encryption errors */
"Encryption Error" = "加密錯誤";

/* The placeholder text for the text field to enter a group chat name or label */
"Enter a group name" = "Enter a group name";

/* Title of error message pop-up box */
"Error" = "Error";

/* title label for error when creating account */
"Error Creating Account" = "開新帳號時發生錯誤";

/* SSL error message */
"Export restriction" = "匯出受限";

/* Default message when a user status is set to extended away */
"Extended Away" = "遠遠離開";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "連接 XMPP 伺服器失敗，請檢查您的帳號、密碼及網路連線後再嘗試登入。";

/* SSL error message */
"Fatal alert" = "嚴重錯誤";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "忘記密碼？";

/* whether or not we should generate a strong password for them */
"Generate Secure Password" = "Generate Secure Password";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* a subtitle label for a group chat */
"Group Chat" = "Group Chat";

/* The title for the view to enter a group chat name or label */
"Group Name" = "Group Name";

/* SSL error message */
"Handshake failure" = "與伺服器握手失敗";

/* Label for button to open link to translate app */
"Help Translate" = "協助我們翻譯";

/* Label for button to hold to record audio */
"Hold to talk" = "Hold to talk";

/* Label text for hostname field on login scree */
"Hostname" = "主機名稱";

/* SSL error message */
"I/O would block (not fatal)" = "I/O 可能受阻 (非嚴重)";

/* SSL error message */
"Illegal parameter" = "參數不合法";

/* Label for incoming data transfers */
"Incoming" = "Incoming";

/* Short for information, button title to get more information */
"Info" = "資訊";

/* SSL error message */
"Insufficient buffer provided" = "緩衝記憶體不足";

/* SSL error message */
"Insufficient security" = "安全性不足";

/* SSL error message */
"Internal error" = "內部錯誤";

/* SSL error message */
"Invalid certificate chain" = "憑證無效";

/* title label for invalid email */
"Invalid Email" = "錯誤的 Email";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Jabber (XMPP)";

/* Label for button after to send push notification knock. Like knocking on a door */
"Knock" = "Knock";

/* Text for label after knock is sent. Like knocking on a door */
"Knock Sent" = "Knock Sent";

/* string to bring up language selector */
"Language" = "語言";

/* log in to account */
"Log In" = "登入";

/* log out from account */
"Log Out" = "登出";

/* Label for account setting that autologins on launch */
"Login Automatically" = "自動登入";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "設定 ChatSecure 的訊息推送帳戶";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "管理已儲存的 SSL 憑證";

/* No comment provided by engineer. */
"Me" = "Me";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "訊息不能傳送，因為有人已離開了加密對話。我們應該也關閉這對話或更新它的連線。";

/* microphone permission is disabled */
"Microphone Disabled" = "Microphone Disabled";

/* SSL error message */
"Miscellaneous bad certificate" = "各種不良的憑證";

/* SSL error message */
"Module attach failure" = "模組無法添加";

/* Your QR code */
"My QR Code" = "My QR Code";

/* The string describing a buddy's display name */
"Name" = "名稱";

/* For a new settings value */
"New" = "新";

/* Title for New Account View */
"New Account" = "新增帳號";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "新 SSL 憑證";

/* Label for button to go to next step */
"Next" = "下一個";

/* for choosing your XMPP vCard display name */
"Nickname" = "Nickname";

/* SSL error message */
"No Error" = "沒有錯誤";

/* SSL error message */
"No renegotiation allowed" = "不允許重新連線";

/* Label in buddy list for users that are offline */
"Offline" = "離線";

/* Accept the dialog */
"OK" = "確定";

/* For an old settings value */
"Old" = "舊";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "用 Chrome 開啟";

/* Label for button to open link in facebook app */
"Open in Facebook" = "用 Facebook 開啟";

/* Label for button to open link in twitter app */
"Open in Twitter" = "用 Twitter 開啟";

/* Hint text for domain field telling user this field is not required */
"Optional" = "可選";

/* Title for other miscellaneous settings group */
"Other" = "其它";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "我們的政策要求加密，但我們正試圖傳送未加密訊息。";

/* Label text for password field on login screen */
"Password" = "密碼";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "端點的憑證有效，或者因為驗證功能被關閉而略過。";

/* SSL error message */
"Peer dropped connection before responding" = "端點在回應前斷開連線";

/* SSL error message */
"Peer host name mismatch" = "端點主機名稱不吻合";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "等待通過驗證";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "永久刪除";

/* Label for button to open up photo library and choose photo */
"Photo Library" = "Photo Library";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "已固定的憑證";

/* Label for messages that are not encrypted */
"plaintext" = "plaintext";

/* No comment provided by engineer. */
"Plaintext (Opportunistic OTR)" = "Plaintext (Opportunistic OTR)";

/* No comment provided by engineer. */
"Plaintext Only" = "Plaintext Only";

/* detail title label for invalid email */
"Please choose a valid email address" = "請選擇有效的 email 地址";

/* Label for port number field for connecting to service */
"Port" = "埠";

/* title for contacts profile view */
"Profile" = "Profile";

/* Title for push-messaging related settings */
"Push" = "訊息推送服務";

/* Label for qr code image */
"QR code" = "二維條碼";

/* Error string for OTR message string */
"Received a general OTR error." = "收到 OTR 概括錯誤訊息";

/* Error string for OTR message string */
"Received a heartbeat." = "收到維持連線要求";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "收到加密的訊息，但無法讀取，因為尚未建立加密連線。";

/* Error string for OTR message string */
"Received an unencrypted message." = "收到未加密的訊息。";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "收到訊息並已拋棄，因為那是給別的程式的。";

/* Error string for OTR message string */
"Received our own OTR messages." = "收到自己傳出的 OTR 加密訊息";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "最近交談";

/* SSL error message */
"Record overflow" = "通話紀錄長度超過上限";

/* Button title to reject a request such as a buddy request */
"Reject" = "拒絕";

/* Label for instruction to delete current recording */
"Release to delete" = "Release to delete";

/* Label for instruction to send current audio */
"Release to send" = "Release to send";

/* Label for switch to save passphrase */
"Remember Passphrase" = "幫我記住密碼";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "記住密碼";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "刪除";

/* No comment provided by engineer. */
"Removed By Server" = "Removed By Server";

/* Reply to an incoming message */
"Reply" = "回覆";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "必填";

/* Label for button to resend message. */
"Resend" = "Resend";

/* Ttitle for alert view to resend a message */
"Resend Message" = "Resend Message";

/* Describe what resending will do the %@ will be replaced withe the method OTR/OMEMO/Plaintext */
"Resending this message will use %@." = "Resending this message will use %@.";

/* Label for text input for XMPP resource */
"Resource" = "資源";

/* Title for button for saving a setting */
"Save" = "儲存";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "已儲存的憑證";

/* Label for sharing via QR Code */
"Scan QR" = "Scan QR";

/* Label for text field where you search for a buddy */
"Search" = "搜尋";

/* Title heading in settings */
"Security" = "安全性";

/* Title of alert box warning about security issues */
"Security Warning" = "安全警告";

/* The placeholder text in the chat view where the message should go */
"Send %@ encrypted message" = "Send %@ encrypted message";

/* String on button to email feedback */
"Send Feedback" = "發送反饋";

/* The placeholder text in the chat view where the message should go */
"Click here to type something..." = "Click here to type something...";

/* Label text for when a transfer is in progress (normally followed by a percent value 34%) */
"Sending" = "Sending";

/* Error string for OTR message string */
"Sent a heartbeat." = "已送出維持連線請求";

/* server selection section title */
"Server" = "Server";

/* SSL error message */
"Server closed session with no notification" = "伺服器關閉連線而沒有通知";

/* SSL error message */
"Server has requested a client cert" = "伺服器要求客戶端憑證";

/* Title for the Settings screen */
"Settings" = "設定";

/* Title for sharing a link to the app */
"Share" = "分享";

/* Label for inviting friends via URL */
"Share Invite" = "Share Invite";

/* No comment provided by engineer. */
"Show Advanced Encryption Settings" = "Show Advanced Encryption Settings";

/* toggle switch for show advanced */
"Show Advanced Options" = "Show Advanced Options";

/* title label for signing up for a new account */
"Sign Up" = "註冊";

/* Label for button to skip this step */
"Skip" = "略過";

/* A placeholder for a buddy's username like Someone wants to chat. */
"Someone" = "Someone";

/* SSL error message */
"SSL protocol error" = "錯誤的 SSL 協定";

/* Label for button to take a photo from camera */
"Take Photo" = "Take Photo";

/* No comment provided by engineer. */
"The app crashed last time it was launched. Send a crash report?" = "The app crashed last time it was launched. Send a crash report?";

/* Error string for OTR message string */
"The message received contains malformed data." = "收到的訊息包含格式錯誤的資料";

/* Error string for OTR message string */
"The previous message was resent." = "上一則訊息已重送";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "XMPP 伺服器不支援用程式註冊新帳號";

/* basic setup selection footer */
"Think of a unique nickname that you don't use anywhere else and doesn't contain personal information." = "Think of a unique nickname that you don't use anywhere else and doesn't contain personal information.";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "本裝置似乎尚未設定為能支付款項";

/* Error message description */
"This message was received from an untrusted device." = "This message was received from an untrusted device.";

/* Error message description */
"This message was sent to an untrusted device." = "This message was sent to an untrusted device.";

/* microphone permission is disabled */
"To use this feature you must re-enable microphone permissions." = "To use this feature you must re-enable microphone permissions.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "Tor 尚屬實驗性的功能，請小心使用。";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* Title for error message */
"Unable to Send Message" = "Unable to Send Message";

/* SSL error message */
"Underlying cryptographic error" = "加密程式錯誤";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "DTLS 有不在預期中的（被略過的）紀錄";

/* SSL error message */
"Unexpected message received" = "收到不在預期中的訊息";

/* SSL error message */
"Unknown Cert Authority" = "未知的憑證發行人";

/* SSL error message */
"Unknown certificate" = "未知的憑證";

/* Describes an error without a known cause */
"Unknown Error" = "Unknown Error";

/* Label for button to unlock app */
"Unlock" = "解鎖";

/* shown when invite QR code doesnt work */
"Unrecognized Invite Format" = "Unrecognized Invite Format";

/* Title for error message */
"Untrusted Device" = "Untrusted Device";

/* SSL error message */
"User canceled" = "使用者取消動作";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "帳號";

/* SSL error message */
"Valid cert chain, untrusted root" = "有效的憑證鍊，但根憑證不受信賴";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "有效的憑證";

/* To let the user know the fingerprint as been checked */
"Verified" = "已檢驗";

/* Shown when verifying fingerprints */
"Verify" = "檢驗";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "檢驗指紋";

/* when displaying version numbers such as 1.0.0 */
"Version" = "版本";

/* The label for a button to view the buddy profile */
"View Profile" = "View Profile";

/* Describe how to change a contact's device settings */
"View profile to review contact's devices or change encryption settings." = "View profile to review contact's devices or change encryption settings.";

/* Label text for when a transfer has not started yet */
"Waiting" = "Waiting";

/* This string follows a user's dislplay name or username ex Bob wants to chat. */
"wants to chat." = "wants to chat.";

/* help text for password generator */
"We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else." = "We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this account." = "We could not find any trusted devices for this account.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this contact." = "We could not find any trusted devices for this contact.";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "您要連線到使用者討論區並送出回饋嗎？";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* String used when onboarding works */
"You're ready to use" = "You're ready to use";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "您的捐助將幫助 ChatScure 的長期發展。";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "您的程式密碼只會儲存在這台裝置的 iOS 鑰匙圈上，鑰匙圈的安全性跟您的裝置一樣強或一樣弱，是您的裝置本身有無密碼以及密碼強度而定。然而，程式密碼不能透過 iTunes 備份和還原，所以不要忘記這密碼，否則在系統還原後可能會失去聊天紀錄。";

